lib/api/api_helper.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def authenticated
      return true if warden.authenticated?
      return if headers['Access-Token'].blank?

      payload = decode_jwt(headers['Access-Token'])&.first
      return unless payload

      (@user = User.find_by(id: payload['id'])) && (@user.sub_admin? || @user.admin?)