lib/api/chat/create.rb

INSERT INTO "chat_users" ("user_id", "chat_id") VALUES ($1, $2) RETURNING "id"  [["user_id", 2], ["chat_id", 2]]
INSERT INTO "chats" ("name") VALUES ($1) RETURNING "id"  [["name", "1"]]
---
      end

      post do
        ::Chat.create!(name: params[:name], users: [@user])