lib/api/users/sign_in.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "a@a1"], ["LIMIT", 1]]
---
      end

      post 'sign_in' do
        user = User.find_by(email: params[:email])