lib/api/users/sign_up.rb

      end

      post 'sign_up' do
        ::User.create!(email: params[:email], password: params[:password])
---
INSERT INTO "users" ("email", "encrypted_password", "confirmation_token", "confirmation_sent_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"